raghunathF/Fi_Mi/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/main.c
static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */
static uint8_t index = 0;

static bool broadcast_flag = false;
static bool UART_interrupt_flag = false;

uint16_t transmit_length = 0;


APP_TIMER_DEF(transmit_timer_id);

static bool first_byte = true;
static uint8_t length_receive = 0 ;

static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];

volatile  uint32_t LED_value = 0;

uint8_t    sensor_outputs[20];


const char possible_names[] = {'F','N','H','M','F','L','H','B','B','2','C','3'};   //Just to be safe used A1,B2,C3
char 	DEVICE_NAME [20];
/*

#define LROW_0 13 
#define LROW_1 14
#define LROW_2 15



#define LCOL_0 4
#define LCOL_1 5
#define LCOL_2 6
#define LCOL_3 7
#define LCOL_4 8
#define LCOL_5 9
#define LCOL_6 10
#define LCOL_7 11
#define LCOL_8 12


#define TOTAL_RC 12 

#define BUTTON_A 17
#define BUTTON_B 26

*/


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

char convert_ascii(char input)
{
	char output;
	if(input >= 0 & input <=9)
	{
		output = input + 0x30;
	}
	else
	{
		output = input + 0x37;
	}
	return output;
}



/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
	
		ble_gap_addr_t 					mac;
		uint8_t 								addr_byte	 = 0;
	
		
		sd_ble_gap_address_get(&mac);
	
		
	  DEVICE_NAME[0] = 'F';
		DEVICE_NAME[1] = 'N';
	  DEVICE_NAME[2] = convert_ascii((mac.addr[2]&0x0F));
	
		DEVICE_NAME[3] = (mac.addr[1]&0xF0);
		DEVICE_NAME[3] = convert_ascii(DEVICE_NAME[3]>>4);
		
		DEVICE_NAME[4] = convert_ascii(mac.addr[1]&0x0F);
		DEVICE_NAME[5] = (mac.addr[0]& 0xF0);
		DEVICE_NAME[5] = convert_ascii(DEVICE_NAME[5]>>4);
		
		DEVICE_NAME[6] = convert_ascii(mac.addr[0]&0x0F);
		DEVICE_NAME[7] = '\0';

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */
int mood_bit = 0;
volatile uint8_t temp_p_data[20];
volatile uint8_t temp_p_sensor_data[20];
volatile uint8_t rgb_value[3];
bool led_change = false;
static bool fake_firware_send = false;

void change_led()
{
	
	 uint32_t temp1 = 0;
	 uint32_t temp2 = 0;
	 uint32_t temp3 = 0;
	 

	 /*
	 if(temp_p_data[0] == 'A')
		{
			
				 temp1 = temp_p_data[7] ;
				 temp2 = temp_p_data[8] ; 
				 temp2 = temp2 << 8; 
				 temp3 = temp_p_data[9] ; 
				 temp3 = temp3 << 16;
				 temp1 = temp1 + temp2 + temp3;
				 LED_value = temp1;
				 led_change = true;
				 rgb_value[0]= temp_p_data[1];
				 rgb_value[1]= temp_p_data[2];
				 rgb_value[2]= temp_p_data[3];
				 
		}
		*/
		
}

static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
	 
		///else
//{		
			uint32_t i =0;
			/*
			for ( i = 0; i < length; i++)
			{
					
					while (app_uart_put(p_data[i]) != NRF_SUCCESS);
			}
			*/
			UART_interrupt_flag = true;
	    transmit_length = length; 
			for ( i = 0; i < length; i++)
			{
					
					temp_p_data[i] = p_data[i];
			}
			//change_led();
			//while (app_uart_put('\r') != NRF_SUCCESS);
			//while (app_uart_put('\n') != NRF_SUCCESS);
	  //}
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;
    ble_nus_init_t nus_init;

    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

