raghunathF/Fi_Mi/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/main.c
}


/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize SoftDevice.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist();
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}
#define SENSORS_LENGTH  5

static void send_fake_firmware_number()
{
	
	uint32_t err_code;
	uint8_t fake_firmware_number[5] = {0x03,0x00,0x02,0x03,0x61};
	err_code = ble_nus_string_send(&m_nus, fake_firmware_number, 5);
	if (err_code != NRF_ERROR_INVALID_STATE)
	{
			APP_ERROR_CHECK(err_code);
	}
}

static void transmit_ble_data()
{
	uint32_t err_code;
	err_code = ble_nus_string_send(&m_nus, sensor_outputs, SENSORS_LENGTH);
	if (err_code != NRF_ERROR_INVALID_STATE)
	{
			APP_ERROR_CHECK(err_code);
	}
}

// Timeout handler for the single shot timer
static void transmit_handler(void * p_context)
{
	uint32_t err_code;
	err_code = ble_nus_string_send(&m_nus, data_array, index+1);
	
	first_byte = true;
	index = 0;
	if (err_code != NRF_ERROR_INVALID_STATE)
	{
			APP_ERROR_CHECK(err_code);
	}
}

static void create_timers()
{   
    uint32_t err_code;

    // Create timers
    err_code = app_timer_create(&transmit_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                transmit_handler);
    APP_ERROR_CHECK(err_code);
}
//
void start_timer()
{
	uint32_t error_code_1=0;
	error_code_1 = app_timer_start(transmit_timer_id, APP_TIMER_TICKS(4, APP_TIMER_PRESCALER), NULL);
  APP_ERROR_CHECK(error_code_1);
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
/*
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}

*/

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to 
 *          a string. The string will be be sent over BLE when the last character received was a 
 *          'new line' i.e '\n' (hex 0x0D) or if the string has reached a length of 
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    
    volatile uint32_t       err_code;
		static uint8_t tmpByte = 0;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
        		app_uart_get(&tmpByte);
						if(first_byte == true)
						{
							start_timer();
							first_byte = false;
							index = 0;
							data_array[index] = tmpByte;
							
						}
						else
						{
							index++;
							data_array[index] = tmpByte;							
						}
	
            break;

        case APP_UART_COMMUNICATION_ERROR:
					  err_code = p_event->data.error_code;
						app_uart_flush();
            break;

        case APP_UART_FIFO_ERROR:
					  err_code = p_event->data.error_code;
						app_uart_flush();
            break;

        default:
            break;
    }
}


