raghunathF/Fi_Mi/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/main.c
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_MICRO,
        TX_MICRO,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
/*
static int* init_LED_array()
{
	int LRC_array[12];
	LRC_array[0] = LROW_0;
	LRC_array[1] = LROW_1;
	LRC_array[2] = LROW_2;
  LRC_array[3] = LCOL_0;
	LRC_array[4] = LCOL_1;
	LRC_array[5] = LCOL_2;
	LRC_array[6] = LCOL_3;
	LRC_array[7] = LCOL_4;
	LRC_array[8] = LCOL_5;
	LRC_array[9] = LCOL_6;
	LRC_array[10] = LCOL_7;
	LRC_array[11] = LCOL_8;
	return LRC_array;
}
*/
/*
static void leds_init(void)
{
	  int* LRC_array = NULL;
		int i =0;	
	  //LRC_array = init_LED_array();
	
	  //for(i=0; i<= TOTAL_RC ;i++)
	  //{
		 // nrf_gpio_cfg_output(LRC_array[i]);
			//nrf_gpio_pin_clear(LRC_array[i]);
	  //}
		
	  nrf_gpio_cfg_output(LROW_0);
	  nrf_gpio_cfg_output(LCOL_0);
		nrf_gpio_cfg_input(BUTTON_A,NRF_GPIO_PIN_PULLUP);
		nrf_gpio_cfg_input(BUTTON_B,NRF_GPIO_PIN_PULLUP);

	  
	  
		//nrf_gpio_cfg_input(ADVERTISE_PIN,NRF_GPIO_PIN_PULLUP);	
		
	//	nrf_gpio_cfg(ADDR0_PIN, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
	//	nrf_gpio_cfg(ADDR1_PIN, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
	//	nrf_gpio_cfg(ADDR2_PIN, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_S0S1, NRF_GPIO_PIN_NOSENSE);
	
		//nrf_gpio_cfg_input(ADDR0_PIN,NRF_GPIO_PIN_PULLUP);		
		//nrf_gpio_cfg_input(ADDR1_PIN,NRF_GPIO_PIN_PULLUP);		
		//nrf_gpio_cfg_input(ADDR2_PIN,NRF_GPIO_PIN_PULLUP);		
}
*/



/**@brief Application main function.
 */

void check_BLE_data()
{
	uint32_t temp =0;
	temp = LED_value;
	set_all_led_once(temp);
	if(led_change == true)
	{
		led_change = false;
		LED_control(rgb_value[0],rgb_value[1],rgb_value[2]);
	}
}




int main(void)
{
    volatile uint32_t err_code;
    bool erase_bonds;
	  static bool first_time = false;
		static uint16_t count_broadcast = 0;
	  temp_p_data[0] = 0xCA;
	  temp_p_data[1] = 0xC1;
	  temp_p_data[2] = 0xC2;
	  temp_p_data[3] = 0xC3;
		temp_p_data[4] = 0xC4;
	  temp_p_data[5] = 0xC5;
	  temp_p_data[6] = 0xC6;
	  temp_p_data[7] = 0xC7;
		temp_p_data[8] = 0xC8;
	  temp_p_data[9] = 0xC9;
	  temp_p_data[10] = 0xCA;
	  temp_p_data[11] = 0xCB;
		temp_p_data[12] = 0xCC;
	  temp_p_data[13] = 0xCD;
	  temp_p_data[14] = 0xCE;
	  temp_p_data[15] = 0xCF;
		temp_p_data[16] = 0xD0;
		temp_p_data[17] = 0xD1;
		temp_p_data[18] = 0xD2;

		init_LEDs();
	  //init_finch_LED();
		init_buzzer();
	  test_LED_4();
	  LED_value = 0x0055555555;
	   
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	  create_timers();
	  
	  
		//Initialize Uart
    //uart_init();
	  
	  //nrf_delay_ms(50);
		//leds_init();
	
    //buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    //printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
	  //nrf_gpio_pin_set(LROW_0);
		//nrf_gpio_pin_clear(LCOL_0);
		SPI_init(); 
		 
		 
    // Enter main loop.
    for (;;)
    {
        //power_manage();
			//while(1)
			//
			
			if(spi_xfer_done == true)
			{
				  nrf_delay_ms(60);
					if(UART_interrupt_flag == true)
					{
						
						UART_interrupt_flag = false;
						
						if(temp_p_data[0] == 'G')
						 {
							 if(temp_p_data[1] == '4')
							 {
								 send_fake_firmware_number();
								 broadcast_flag = true;
							 }
							 
						 }
						else
						{
							if(transmit_length ==19)
							{
								if(temp_p_data[0] == 'A')
								{
									temp_p_data[0] = 0xCA;
									transfer_data(transmit_length);
									//read_data();
									//transmit_ble_data();
								}
								
								//transfer_data(transmit_length);
								
							}
						 
						}
						
						
					}
					
					else if(broadcast_flag == true)
			    {
						//if(count_broadcast > 65500)
						//{
						  //nrf_delay_ms(30);
							temp_p_sensor_data[0] = 0xCC;
							//temp_p_sensor_data[1] = 0x8E;
							//temp_p_sensor_data[2] = 0x8D;
							//temp_p_sensor_data[3] = 0x8C;
							//temp_p_sensor_data[4] = 0x8B;
							count_broadcast = 0;
							transfer_data_sensor(19);
						  read_data();
							transmit_ble_data();
						  
						//}
					 
					  count_broadcast++;
		      }
					
						
			}
			
			//nrf_delay_ms(30);
			
			//check_BLE_data();
				//test_LED_4();
			//}
    }
}


/**
 * @}
 */
